<template>
    <div>
        <p style="text-align:center">举报需知</p>
        <p>一、受理范围</p>
        <h3 style="color:red">《查法普法网站》不具备现场、紧急报警的受理功能，如您的情况紧急，请立即拨打报警电话“110”。</h3>
        <p>本网站受理涉嫌违反《全国人民代表大会常务委员会关于维护互联网安全的决定》、《中华人民共和国刑法》、《中华人民共和国治安管理处罚法》、《互联网信息服务管理办法》等法律法规有关条款规定，利用互联网或针对网络信息系统从事违法犯罪行为的线索，具体行为包括:</p>
        <p>1、侵入国家事务、国防建设、尖端科学技术领域的计算机信息系统；</p>
        <p>2、故意制作、传播计算机病毒等破坏性程序，攻击计算机系统及通信网络，致使计算机系统及通信网络遭受损害；</p>
        <p>3、利用互联网进行邪教组织活动的；</p>
        <p>4、利用互联网捏造或者歪曲事实、散布谣言，扰乱社会秩序的；</p>
        <p>5、利用互联网建立淫秽色情网站、网页，提供淫秽站点链接，传播淫秽色情信息，组织网上淫秽色情的；</p>
        <p>6、利用互联网引诱、介绍他人卖淫的；</p>
        <p>7、利用互联网进行诈骗的；</p>
        <p>8、利用互联网进行赌博的；</p>
        <p>9、利用互联网贩卖枪支、弹药、毒品等违禁物品以及管制刀具的；</p>
        <p>10、利用互联网贩卖居民身份证、假币、假发票、假证，组织他人出卖人体器官的；</p>
        <p>此外，本网站欢迎并鼓励广大网民积极举报网上含有宣扬“暴力夺取政权、建立东突国家”、“对异教徒圣战”等暴力恐怖思想和宗教极端思想，传授制枪、制爆、制毒方法，教唆、煽动实施暴力恐怖活动等音视频信息。</p>
        <div>
            <el-button type="info" @click="toReport">同意</el-button>
            <el-button type="info" @click="toHome">不同意</el-button>
        </div>
        
    </div>
</template>
<script>

export default ({
    data(){
        return {

        }
    },
    methods:{
        toReport(){
            this.$router.push('/EmergencyAlarm/report')
        },
        toHome(){
            this.$router.push('/Home')
        }
    }
})
</script>

<style scoped>
p{
    text-align: left;
}
</style>